studies/KarmanVortexStreetTurbulent/case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       681352;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       681452;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          320;
        startFace       681552;
    }
    back
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          29704;
        startFace       681872;
    }
    front
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          29704;
        startFace       711576;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2944;
        startFace       741280;
    }
)

// ************************************************************************* //
