studies/KarmanVortexStreetTurbulent/case/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }

application     icoFoam;
startTime       0; // if restarting the simulation
startFrom       latestTime; // latestTime if restarting from a previous run
stopAt          endTime;
endTime         200;      // total simulation time

// time step control
adjustTimeStep  yes;
// maximum stability limit (max CFL number)
// for icofam/pimpleFoam, 0.5 is a safe value, max 1 for Navier-Stokes solvers
maxCo           1;
// maximum time step size (for safety, to avoid too large time steps in case of high velocities)
maxDeltaT       0.8;

// initial time step (OpenFOAM will adjust it immediately after the first step)
deltaT          0.01;

writeControl    runTime;
writeInterval   2;      // time step for saving results


// Post-processing functions
functions
{
    forces
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    timeStep;
        timeInterval    1;
        log             yes;
        patches         (cylinder); // name of the patch where forces are calculated
        rho             rhoInf;      // Incompressible
        rhoInf          1;           // volumic mass density (kg/m³)
        CofR            (0 0 0);     // moment rotation center (origin)
        liftDir         (0 1 0);     // Lift direction (Y)
        dragDir         (1 0 0);     // Drag direction (X)
        pitchAxis       (0 0 1);
        magUInf         0.01;        // inlet velocity magnitude
        lRef            0.2;         // reference length (diameter D)
        Aref            0.01;        // reference area (D * domain thickness (0.2 * 0.05))
    }
}